## 📝 Terraform Plan Results

### 📂 Directory: `terraform`

<details><summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.primary will be created
  + resource "aws_dynamodb_table" "primary" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "global-table-example"
      + read_capacity    = 5
      + region           = "us-west-2"
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_AND_OLD_IMAGES"
      + tags_all         = {
          + "ManagedBy" = "Terraform"
        }
      + write_capacity   = 5

      + attribute {
          + name = "id"
          + type = "S"
        }

      + replica {
          + arn                         = (known after apply)
          + consistency_mode            = "EVENTUAL"
          + deletion_protection_enabled = (known after apply)
          + kms_key_arn                 = (known after apply)
          + point_in_time_recovery      = false
          + propagate_tags              = false
          + region_name                 = "us-west-2"
          + stream_arn                  = (known after apply)
          + stream_label                = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + table_arn        = (known after apply)
  + table_name       = "global-table-example"
  + table_stream_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

